Repository: Zheneq/Neuromonk
Catalog: loc/*.po
Languages: ru

source: %(player)s places %(hex)s to cell %(index)d
ru: %(player)s располагает %(hex)s в клетке %(index)d

source: %(player)s moves %(hex)s to cell %(index)d
ru: %(player)s передвигает %(hex)s в клетк %(index)d

source: %(player)s removes %(hex)s from his hand
ru: %(player)s выкинул %(hex)s с руки

source: %(player)s refreshes his hand.
ru: %(player)s сбросил всю руку.

source: %(player)s , please, place your HQ.
ru: %(player)s, расположите свой штаб.

source: %(player)s revokes his actions.
ru: %(player)s отменил свои действия.

source: %(player)s's HQ is destroyed.
ru: Штаб %(player)s уничтожен.

source: Congratulations, %(player)s!
ru: Поздравляем с победой, %(player)s!

source: %(player)s's HQ: %(hp)d hp.
ru: Штаб %(player)s: %(hp)d хп.

source: %(player)s's HQ is more damaged.
ru: Штаб %(player)s получил больше повреждений.

source: HQs are equally damaged.
ru: Штабы повреждены одинаково.

source: That's a draw(
ru: Ничья.

source: The Final Battle begins!
ru: Да начнётся последняя битва!

source: %s's turn!
ru: Ход %s

source: Let the Battle Begin!!!
ru: Да начнётся битва!

source: Maximum initiative is %d
ru: Максимальная инициатива: %d

source: Battle phase %d begins.
ru: Начинается %d фаза битвы.

source: %(army)s %(hex)s converted his attack of direction %(dir)d to melee
ru: %(hex)s армии %(army)s преобразовал атаку по направлению %(dir)d в рукопашную.

source: %(army)s %(hex)s converted his attack of direction %(dir)d to range
ru: %(hex)s армии %(army)s преобразовал атаку по направлению %(dir)d в выстрел.

source: %(army)s %(hex)s (cell %(index)d) damaged:
ru: %(hex)s армии %(army)s (клетка %(index)d) атаковал:

source: %(army)s %(hex)s (cell %(index)d) (%(type)s, %(value)d wounds)
ru: %(hex)s армии %(army)s (клетка %(index)d) (%(type)s, -%(value)d хп)

source: %s died because of natural causes. Indeed, he was scattered by explosion. It's just natural he died
ru: %s скончался от естественных причин. Его разорвало на части. Естественно, он умер.

source: %s died.
ru: %s умер.

source: %(army)s %(hex)s (cell %(index)d) saves %(other_hex)s (cell %(other_index)d from %(damage)d wounds.)
ru: %(hex)s армии %(army)s (клетка %(index)d) спас %(other_hex)s (клетка %(other_index)d от атаки силы %(damage)d.)

source: Medic
ru: Медик

source: en
ru: ru

source: with turn %d
ru: с поворотом %d

source: Loading Neuroshima HEX! 3.0...
ru: Загрузка игры Neuroshima HEX! 3.0...

source: Failed to load image for %s button.
ru: Изображение для кнопки %s не найдено.
